spikonado/variobot/variobot_mcu/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Arduino ESP32
CONFIG_AUTOSTART_ARDUINO=n

# FREERTOS
CONFIG_FREERTOS_HZ=1000

# Keep PCNT overflow compensation and count reads usable if flash cache is off
CONFIG_PCNT_ISR_IRAM_SAFE=y
CONFIG_PCNT_CTRL_FUNC_IN_IRAM=y
